app/controllers/sports_controller.rb

  def index
    @sports = Sport.all
---
SELECT "sports".* FROM "sports"

  def create
    @sport = Sport.new(sport_params)

    if @sport.save
---
INSERT INTO "sports" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "natação"], ["created_at", "2022-05-25 03:59:52.226178"], ["updated_at", "2022-05-25 03:59:52.226178"]]